#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/BrynardSecurity/dev-us-west-2/runs/run-2E1NmxBary2bUu8w

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.dev-us-east-2-tgw.aws_ec2_transit_gateway.this[0]: Refreshing state... [id=tgw-0546e11adbd2371bd]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0261bdbbc153a0f57]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0c0a4a2fbf8ae4d18]
module.dev-us-east-2-tgw.aws_ram_resource_share.this[0]: Refreshing state... [id=arn:aws:ram:us-west-2:600252898040:resource-share/6a07e1fd-5afe-409a-b1af-8faf7675af5e]
module.vpc.aws_customer_gateway.this["IP1"]: Refreshing state... [id=cgw-01769867002a0090f]
module.dev-us-east-2-tgw.aws_ec2_transit_gateway_route_table.this[0]: Refreshing state... [id=tgw-rtb-013399ea63cd1230e]
module.dev-us-east-2-tgw.aws_ec2_tag.this["Purpose"]: Refreshing state... [id=tgw-rtb-0f53a2c475f36d424,Purpose]
module.dev-us-east-2-tgw.aws_ec2_tag.this["Name"]: Refreshing state... [id=tgw-rtb-0f53a2c475f36d424,Name]
module.dev-us-east-2-tgw.aws_ram_resource_association.this[0]: Refreshing state... [id=arn:aws:ram:us-west-2:600252898040:resource-share/6a07e1fd-5afe-409a-b1af-8faf7675af5e,arn:aws:ec2:us-west-2:600252898040:transit-gateway/tgw-0546e11adbd2371bd]
module.dev-us-east-2-tgw.aws_ram_principal_association.this[0]: Refreshing state... [id=arn:aws:ram:us-west-2:600252898040:resource-share/6a07e1fd-5afe-409a-b1af-8faf7675af5e,880955004141]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-05cf956e300a0ae8f]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0f7e8537a45dd10f5]
module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-09a6b8d2c0d6fc5d8]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0d80f6b248474642a]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-08b5df896eda188bf]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0908ab8f66c419fef]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0763d1e6600906445]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-030c5d1573aed0fd1]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-040f8b9863d86a074]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0fa9f9454da94d6ef]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a7a540db88dc96c3]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-069b72b53177bcf79]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08b5df896eda188bf1080289494]
module.vpn-gateway.aws_vpn_gateway_attachment.default[0]: Refreshing state... [id=vpn-attachment-670b9f00]
module.vpn-gateway.aws_vpn_gateway_route_propagation.private_subnets_vpn_routing[0]: Refreshing state... [id=vgw-09a6b8d2c0d6fc5d8_rtb-0908ab8f66c419fef]
module.vpn-gateway.aws_vpn_gateway_route_propagation.private_subnets_vpn_routing[1]: Refreshing state... [id=vgw-09a6b8d2c0d6fc5d8_rtb-0908ab8f66c419fef]
module.vpn-gateway.aws_vpn_gateway_route_propagation.private_subnets_vpn_routing[2]: Refreshing state... [id=vgw-09a6b8d2c0d6fc5d8_rtb-0908ab8f66c419fef]
module.vpn-gateway.aws_vpn_connection.default[0]: Refreshing state... [id=vpn-0f545ca02a117ce61]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0681468284c538cd3]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-00e8792dbf7af6cb3]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0dd5411c3ee4ab112]
module.dev-us-east-2-tgw.aws_ec2_transit_gateway_vpc_attachment.this["vpc"]: Refreshing state... [id=tgw-attach-0f423538e5b3442df]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c999ec104c0861b0]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-01291aae8b61fe013]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-046d866e496687561]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e10fa85bb54c8ece]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0908ab8f66c419fef1080289494]
module.dev-us-east-2-tgw.aws_ec2_transit_gateway_route.this[0]: Refreshing state... [id=tgw-rtb-013399ea63cd1230e_10.99.0.0/16]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vpn-gateway.aws_vpn_connection.default[0] has been changed
  ~ resource "aws_vpn_connection" "default" {
        id                                   = "vpn-0f545ca02a117ce61"
        tags                                 = {
            "Name" = "VPN Connection between VPC vpc-0c0a4a2fbf8ae4d18 and Customer Gateway cgw-01769867002a0090f"
        }
      + tunnel1_ike_versions                 = []
      + tunnel1_phase1_dh_group_numbers      = []
      + tunnel1_phase1_encryption_algorithms = []
      + tunnel1_phase1_integrity_algorithms  = []
      + tunnel1_phase2_dh_group_numbers      = []
      + tunnel1_phase2_encryption_algorithms = []
      + tunnel1_phase2_integrity_algorithms  = []
      + tunnel2_ike_versions                 = []
      + tunnel2_phase1_dh_group_numbers      = []
      + tunnel2_phase1_encryption_algorithms = []
      + tunnel2_phase1_integrity_algorithms  = []
      + tunnel2_phase2_dh_group_numbers      = []
      + tunnel2_phase2_encryption_algorithms = []
      + tunnel2_phase2_integrity_algorithms  = []
        # (39 unchanged attributes hidden)
    }
  # module.vpc.aws_default_route_table.default[0] has been changed
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-0f7e8537a45dd10f5"
      + propagating_vgws       = []
        tags                   = {
            "DefaultRouteTable" = "true"
            "Name"              = "dev-us-west-2-2021-12-08"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.vpc.aws_route_table.public[0] has been changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-08b5df896eda188bf"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0d80f6b248474642a"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "dev-us-west-2-2021-12-08-public"
        }
        # (5 unchanged attributes hidden)
    }
  # module.vpc.aws_route_table.private[0] has been changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0908ab8f66c419fef"
      ~ propagating_vgws = [
          + "vgw-09a6b8d2c0d6fc5d8",
        ]
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0e10fa85bb54c8ece"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "dev-us-west-2-2021-12-08-private"
        }
        # (4 unchanged attributes hidden)
    }
  # module.vpc.aws_eip.nat[0] has been changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-0087d814e76c2ad34"
        id                   = "eipalloc-0261bdbbc153a0f57"
      + network_interface    = "eni-0990a92c03a9085e8"
      + private_dns          = "ip-10-99-11-93.us-west-2.compute.internal"
      + private_ip           = "10.99.11.93"
        tags                 = {
            "Name" = "dev-us-west-2-2021-12-08-us-west-2a"
        }
        # (8 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.dev-us-east-2-tgw.aws_ec2_tag.this["Name"] will be updated in-place
  ~ resource "aws_ec2_tag" "this" {
        id          = "tgw-rtb-0f53a2c475f36d424,Name"
      ~ value       = "dev-us-west-2-tgw-2021-12-08" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.dev-us-east-2-tgw.aws_ec2_transit_gateway.this[0] will be updated in-place
  ~ resource "aws_ec2_transit_gateway" "this" {
        id                                 = "tgw-0546e11adbd2371bd"
      ~ tags                               = {
          - "Name"    = "dev-us-west-2-tgw-2021-12-08"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
      ~ tags_all                           = {
          - "Name"    = "dev-us-west-2-tgw-2021-12-08"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.dev-us-east-2-tgw.aws_ec2_transit_gateway_route_table.this[0] will be updated in-place
  ~ resource "aws_ec2_transit_gateway_route_table" "this" {
        id                              = "tgw-rtb-013399ea63cd1230e"
      ~ tags                            = {
          - "Name"    = "dev-us-west-2-tgw-2021-12-08"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name"    = "dev-us-west-2-tgw-2021-12-08"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.dev-us-east-2-tgw.aws_ec2_transit_gateway_vpc_attachment.this["vpc"] will be updated in-place
  ~ resource "aws_ec2_transit_gateway_vpc_attachment" "this" {
        id                                              = "tgw-attach-0f423538e5b3442df"
      ~ tags                                            = {
          - "Name"    = "dev-us-west-2-tgw-2021-12-08-vpc"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
      ~ tags_all                                        = {
          - "Name"    = "dev-us-west-2-tgw-2021-12-08-vpc"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.dev-us-east-2-tgw.aws_ram_resource_share.this[0] will be updated in-place
  ~ resource "aws_ram_resource_share" "this" {
        id                        = "arn:aws:ram:us-west-2:600252898040:resource-share/6a07e1fd-5afe-409a-b1af-8faf7675af5e"
      ~ name                      = "dev-us-west-2-tgw-2021-12-08" -> (known after apply)
      ~ tags                      = {
          - "Name"    = "dev-us-west-2-tgw-2021-12-08"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
      ~ tags_all                  = {
          - "Name"    = "dev-us-west-2-tgw-2021-12-08"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.hashicorp-vault.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security Group managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "hashicorp-vault-egress-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "hashicorp-vault-egress"
        }
      + tags_all               = {
          + "Name" = "hashicorp-vault-egress"
        }
      + vpc_id                 = "vpc-0c0a4a2fbf8ae4d18"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.hashicorp-vault.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "172.25.16.0/20",
        ]
      + description              = "Hashicorp Vault ports"
      + from_port                = 8200
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8200
      + type                     = "ingress"
    }

  # module.vpc.aws_customer_gateway.this["IP1"] will be updated in-place
  ~ resource "aws_customer_gateway" "this" {
        id          = "cgw-01769867002a0090f"
      ~ tags        = {
          - "Name" = "dev-us-west-2-2021-12-08-IP1"
        } -> (known after apply)
      ~ tags_all    = {
          - "Name" = "dev-us-west-2-2021-12-08-IP1"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_default_route_table.default[0] will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-0f7e8537a45dd10f5"
      ~ tags                   = {
          - "DefaultRouteTable" = "true"
          - "Name"              = "dev-us-west-2-2021-12-08"
        } -> (known after apply)
      ~ tags_all               = {
          - "DefaultRouteTable" = "true"
          - "Name"              = "dev-us-west-2-2021-12-08"
        } -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0261bdbbc153a0f57"
      ~ tags                 = {
          - "Name" = "dev-us-west-2-2021-12-08-us-west-2a"
        } -> (known after apply)
      ~ tags_all             = {
          - "Name" = "dev-us-west-2-2021-12-08-us-west-2a"
        } -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-0d80f6b248474642a"
      ~ tags     = {
          - "Name" = "dev-us-west-2-2021-12-08"
        } -> (known after apply)
      ~ tags_all = {
          - "Name" = "dev-us-west-2-2021-12-08"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-0e10fa85bb54c8ece"
      ~ tags                 = {
          - "Name" = "dev-us-west-2-2021-12-08-us-west-2a"
        } -> (known after apply)
      ~ tags_all             = {
          - "Name" = "dev-us-west-2-2021-12-08-us-west-2a"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0908ab8f66c419fef"
      ~ tags             = {
          - "Name" = "dev-us-west-2-2021-12-08-private"
        } -> (known after apply)
      ~ tags_all         = {
          - "Name" = "dev-us-west-2-2021-12-08-private"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-08b5df896eda188bf"
      ~ tags             = {
          - "Name" = "dev-us-west-2-2021-12-08-public"
        } -> (known after apply)
      ~ tags_all         = {
          - "Name" = "dev-us-west-2-2021-12-08-public"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-0fa9f9454da94d6ef"
      ~ tags                            = {
          - "Name" = "dev-us-west-2-2021-12-08-private-us-west-2a"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name" = "dev-us-west-2-2021-12-08-private-us-west-2a"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-0a7a540db88dc96c3"
      ~ tags                            = {
          - "Name" = "dev-us-west-2-2021-12-08-private-us-west-2b"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name" = "dev-us-west-2-2021-12-08-private-us-west-2b"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-069b72b53177bcf79"
      ~ tags                            = {
          - "Name" = "dev-us-west-2-2021-12-08-private-us-west-2c"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name" = "dev-us-west-2-2021-12-08-private-us-west-2c"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-040f8b9863d86a074"
      ~ tags                            = {
          - "Name" = "dev-us-west-2-2021-12-08-public-us-west-2a"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name" = "dev-us-west-2-2021-12-08-public-us-west-2a"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-0763d1e6600906445"
      ~ tags                            = {
          - "Name" = "dev-us-west-2-2021-12-08-public-us-west-2b"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name" = "dev-us-west-2-2021-12-08-public-us-west-2b"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-030c5d1573aed0fd1"
      ~ tags                            = {
          - "Name" = "dev-us-west-2-2021-12-08-public-us-west-2c"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name" = "dev-us-west-2-2021-12-08-public-us-west-2c"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                               = "vpc-0c0a4a2fbf8ae4d18"
      ~ tags                             = {
          - "Name" = "dev-us-west-2-2021-12-08"
        } -> (known after apply)
      ~ tags_all                         = {
          - "Name" = "dev-us-west-2-2021-12-08"
        } -> (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_vpn_gateway.this[0] will be updated in-place
  ~ resource "aws_vpn_gateway" "this" {
        id              = "vgw-09a6b8d2c0d6fc5d8"
      ~ tags            = {
          - "Name" = "dev-us-west-2-2021-12-08"
        } -> (known after apply)
      ~ tags_all        = {
          - "Name" = "dev-us-west-2-2021-12-08"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 20 to change, 0 to destroy.


```

</details>

*Pusher: @RalphBrynard, Action: `pull_request`*